<?php

namespace Database\Seeders;

use App\Models\Kved;
use Illuminate\Database\Seeder;

class KvedSeeder extends Seeder
{
    protected array $kvedsList = [
        ['code' => '35.11', 'name' => 'Виробництво електроенергії'],
        ['code' => '35.12', 'name' => 'Передача електроенергії'],
        ['code' => '35.13', 'name' => 'Розподілення електроенергії'],
        ['code' => '35.14', 'name' => 'Торгівля електроенергією'],
        ['code' => '35.21', 'name' => 'Виробництво газу'],
        ['code' => '35.22', 'name' => 'Розподілення газоподібного палива'],
        ['code' => '35.23', 'name' => 'Торгівля газом через місцеві мережі'],
        ['code' => '35.30', 'name' => 'Постачання пари та кондиційованого повітря'],
        ['code' => '19.20', 'name' => 'Виробництво продуктів нафтоперероблення'],
        ['code' => '46.71', 'name' => 'Оптова торгівля паливом'],
        ['code' => '05.10', 'name' => 'Добування кам\'яного вугілля'],
        ['code' => '05.20', 'name' => 'Добування бурого вугілля'],
        ['code' => '19.10', 'name' => 'Виробництво коксу'],
        ['code' => '66.11', 'name' => 'Адміністрування фінансових ринків'],
        ['code' => '66.12', 'name' => 'Посередництво за договорами по цінних паперах'],
        ['code' => '66.19', 'name' => 'Інша допоміжна діяльність у сфері фінансових послуг'],
        ['code' => '70.22', 'name' => 'Консультування з питань керування'],
        ['code' => '82.99', 'name' => 'Надання допоміжних комерційних послуг'],
        ['code' => '52.10', 'name' => 'Складське господарство'],
        ['code' => '49.50', 'name' => 'Транспортування трубопроводами'],
        ['code' => '62.01', 'name' => 'Комп\'ютерне програмування'],
        ['code' => '62.02', 'name' => 'Консультування з питань інформатизації'],
        ['code' => '63.11', 'name' => 'Оброблення даних, веб-портали'],
        ['code' => '71.12', 'name' => 'Інжиніринг, геологія, геодезія'],
        ['code' => '72.19', 'name' => 'Дослідження в галузі енергетики'],
    ];
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        foreach ($this->kvedsList as $kvedData) {
            Kved::create($kvedData);
        }
    }
}
